# Selecting Rows and Columns

For this exercise we will be working with `yob_1880.csv` file.

### 1. Read Data

Import pandas

In [52]:
import pandas as pd

Locate the `yob_1880.csv`file and read it in `df`dataframe.

In [53]:
df = pd.read_csv('./data/yob1880.csv')

In [54]:
df

           name gender  frequency
0          Mary      F       7065
1          Anna      F       2604
2          Emma      F       2003
3     Elizabeth      F       1939
4        Minnie      F       1746
...         ...    ...        ...
1995     Woodie      M          5
1996     Worthy      M          5
1997     Wright      M          5
1998       York      M          5
1999  Zachariah      M          5

[2000 rows x 3 columns]

### 2. Inspect Data

How many columns and rows are there in the dataframe?

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       2000 non-null   object
 1   gender     2000 non-null   object
 2   frequency  2000 non-null   int64
dtypes: int64(1), object(2)
memory usage: 47.0+ KB

Display the first 3 rows.

In [56]:
df.head(3)

   name gender  frequency
0  Mary      F       7065
1  Anna      F       2604
2  Emma      F       2003

Display the last 3 rows.

In [57]:
df.tail(3)

           name gender  frequency
1997     Wright      M          5
1998       York      M          5
1999  Zachariah      M          5

### 3. Select Columns

Display only the `gender`column

In [58]:
df.gender

0       F
1       F
2       F
3       F
4       F
       ..
1995    M
1996    M
1997    M
1998    M
1999    M
Name: gender, Length: 2000, dtype: object

Display `gender`and `frequency`columns. Display only first 3 rows with these columns.

In [59]:
df.iloc[0:3, 1:3]

  gender  frequency
0      F       7065
1      F       2604
2      F       2003

### 4. Select Rows

Display data for row(s) containing `Anna`

In [60]:
df.loc[df["name"] == "Anna"]

      name gender  frequency
1     Anna      F       2604
1470  Anna      M         12

Display the data for all rows with `William`, `Paul`, and `Anne`.

In [61]:
df.set_index("name", inplace=True)

In [62]:
df.loc[["William","Paul","Anne"]]

        gender  frequency
name
William      F         30
William      M       9532
Paul         M        301
Anne         F        136

Display the `frequency` column for `William`, `Paul`, and `Anne`.

In [63]:
df.loc[["William","Paul","Anne"], ["frequency"]]

         frequency
name
William         30
William       9532
Paul           301
Anne           136

Display both columns for every second name.

In [64]:
df[::2]

        gender  frequency
name
Mary         F       7065
Emma         F       2003
Minnie       F       1746
Ida          F       1472
Bertha       F       1320
...        ...        ...
Unknown      M          5
Wes          M          5
Wood         M          5
Worthy       M          5
York         M          5

[1000 rows x 2 columns]

Set index to column `gender`and store it in another dataframe.

In [65]:
df_new = df.set_index("gender")

In [66]:
df_new

        frequency
gender
F            7065
F            2604
F            2003
F            1939
F            1746
...           ...
M               5
M               5
M               5
M               5
M               5

[2000 rows x 1 columns]

Display first 3 rows of this new dataframe where `gender` is `M`

In [79]:
df_new.loc[["M"]].head(3)

        frequency
gender
M            9655
M            9532
M            5927